//==================================================================
//
//デバッグ表示処理 [debugproc.h]
//Author:Takuto Saeki
//
//==================================================================
#include <d3dx9.h>
#ifndef _DEBUGPROC_H_					//このマクロ定義がされてなかったら
#define _DEBUGPROC_H_					//2重インクルード防止のマクロ定義

//================================================
//インクルード
//================================================

//================================================
//マクロ定義
//================================================

//================================================
//クラス
//================================================
class CDebugProc
{
public:
	CDebugProc();
	~CDebugProc();

	void Init(void);
	void Uninit(void);
	void Print(const char* fmt, ...); 
	static void Draw(void);
private:
	static LPD3DXFONT m_pFont;//フォントへのポインタ
	static char m_aStr[1024];//文字列を格納するバッファ
};

#endif