//==================================================================
//
//ライト処理 [light.h]
//Author:Takuto Saeki
//
//==================================================================
#ifndef _LIGHT_H_					//このマクロ定義がされてなかったら
#define _LIGHT_H_					//2重インクルード防止のマクロ定義

//================================================
//インクルード
//================================================
#include "object.h"
#include <string>

//================================================
//マクロ定義
//================================================

//================================================
//クラス
//================================================
class CLight
{
public:
	CLight();
	~CLight();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

private:
	D3DLIGHT9 m_aLight[3];
};

#endif