//==================================================================
//
//C++とDirectX [main.h]
//Author:Takuto Saeki
//
//==================================================================
#ifndef _MAIN_H_	//このマクロ定義がされてなかったら
#define _MAIN_H_	//2重インクルード防止のマクロ定義

//================================================
//インクルード
//================================================
#include <windows.h>
#define DIRECTINPUT_VERSION (0x0800)	//ビルドの警告対処用マクロ
#include "dinput.h"						//入力処理に必要

//================================================
//ライブラリのリンク
//================================================
#pragma comment(lib,"winmm.lib")
#pragma comment(lib,"winmm.lib")
#pragma comment(lib,"dinput8.lib")	//入力処理に必要

//================================================
//マクロ定義
//================================================
#define CLASS_NAME "WindowClass"					//ウィンドウクラスの名前
#define WINDOW_NAME "お味噌汁ファンタジスタ"		//ウィンドウの名前(キャプションに表示)
#define SCREEN_WIDTH (1280)							//ウィンドウの幅
#define SCREEN_HEIGHT (720)							//ウィンドウの高さ

//================================================
//プロトタイプ宣言
//================================================
LRESULT CALLBACK WindowProc(HWND hWnd, UINT uMsg, WPARAM wParam, LPARAM lParam);

#endif

